#1-st program
print((9 ** 0.5) * 5)

#2-nd program
print(9.99 > 9.98 and 1000 != 1000.1)

#3-rd program
print(((1234 % 1000) // 10) + ((5678 % 1000) // 10))

#4-rd program
print(((int(13.42)) == int((42.13 % 1) * 100)) \
      or int((13.42 * 100) % 100) == int(42.13))
print(((int(13.42)) == int((42.13 % 1) * 100)) \
      and int((13.42 * 100) % 100) == int(42.13))

# Сначала решил старую версию задания,
# там больше понравилось оформление,
# не заметил, что задания разные
# решил и новые, отличающиеся

#3-rd(2) program
print((2 * 2 + 2) == (2 * (2+2)))

#4-rd(2) program
print(int(((float('123.456')) * 10) % 10))
